"""
Набор буков...
"""
import random
import string

all_letters = {'а': ('а', 'a', '@'),
               'б': ('б'),
               'в': ('в'),
               'г': ('г'),
               'д': ('д'),
               'е': ('е'),
               'ё': ('ё'),
               'ж': ('ж'),
               'з': ('з'),
               'и': ('и'),
               'й': ('й'),
               'к': ('к'),
               'л': ('л'),
               'м': ('м'),
               'н': ('н'),
               'о': ('о'),
               'п': ('п'),
               'р': ('р'),
               'с': ('с'),
               'т': ('т'),
               'у': ('у'),
               'ф': ('ф'),
               'х': ('х'),
               'ц': ('ц'),
               'ч': ('ч'),
               'ш': ('ш'),
               'щ': ('щ'),
               'ъ': ('ъ'),
               'ы': ('ы'),
               'ь': ('ь'),
               'э': ('э'),
               'ю': ('ю'),
               'я': ('я'),
               'a': ('a'),
               'b': ('b'),
               'c': ('c'),
               'd': ('d'),
               'e': ('e'),
               'f': ('f'),
               'g': ('g'),
               'h': ('h'),
               'i': ('i'),
               'j': ('j'),
               'k': ('k'),
               'l': ('l'),
               'm': ('m'),
               'n': ('n'),
               'o': ('o'),
               'p': ('p'),
               'q': ('q'),
               'r': ('r'),
               's': ('s'),
               't': ('t'),
               'u': ('u'),
               'v': ('v'),
               'w': ('w'),
               'x': ('x'),
               'y': ('y'),
               'z': ('z')
               }


def combine_letters(some_text):
    result = ''
    for i in some_text:
        result = random.choice(all_letters.get(i))
    return result


if __name__ == '__main__':
    print(combine_letters('ааааааааааааа'))
